tests/CheckoutApi/Model/Webhook/payloads/payment.refund.completed.json

{
    "id": "458a4e068f454f768a40b9e576914820",
    "merchantId": 100017120,
    "timestamp": "2021-05-04T22:08:16.6623+02:00",
    "event": "payment.refund.completed",
    "data": {
        "refundId": "00fb000060923e006937598058c4e7f3",
        "invoiceDetails":{
            "distributionType": "Email",
            "invoiceDueDate": "2021-01-01T00:00:00",
            "invoiceNumber": "800328091K1"
        },
        "amount": {
            "amount": 5500,
            "currency": "SEK"
        },
        "paymentId": "025400006091b1ef6937598058c4e487"
    }
}